app/controllers/sessions_controller.rb

def create
    session[:return_to] = request.referer
	@user = User.find_by_username(params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = '' LIMIT 1